Revit 2025 API
UndoOperation Enumeration
 The operation associated with DocumentChanged event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum UndoOperation
Public Enumeration UndoOperation
public enum class UndoOperation
type UndoOperation
Members
Member name | Value | Description
TransactionCommitted | 0 |  A transaction was committed
TransactionRolledBack | 1 |  A transaction was rolled back
TransactionGroupRolledBack | 2 |  A transaction group was rolled back
TransactionUndone | 3 |  A transaction was undone
TransactionRedone | 4 |  A transaction was redone
See Also
Reference
Autodesk.Revit.DB.Events Namespace